Clean the data and replace all missfits with NaN
for SLName, replace NaN with a hardcoded value 120
for Grade, replace NaN with most occured value (2)
for Pass, drop NaN values

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('student.csv')

In [3]:
df

  SLName StudentName Pass Grade
0    104       Priya    Y     2
1    108      Ramesh    N     2
2    NaN       Deepa    N   NaN
3    345         Ria    N     1
4    abc       Krish  1.2     2
5    223      Geetha    Y   NaN
6    568        Rimi  NaN     2
7    345       Goyal    Y    --
8    101        Sita    Y    na

In [4]:
df['SLName'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
Name: SLName, dtype: bool

In [5]:
#Find number of values that are null
df['SLName'].isnull().sum()

1

In [6]:
df['Grade'].isnull().sum()

2

In [7]:
df['Grade']

0      2
1      2
2    NaN
3      1
4      2
5    NaN
6      2
7     --
8     na
Name: Grade, dtype: object

In [8]:
#Convert all the dirty values to NaN
missing_values = [" --", 'na']
df = pd.read_csv('student.csv', na_values=missing_values)

In [9]:
df

  SLName StudentName Pass  Grade
0    104       Priya    Y    2.0
1    108      Ramesh    N    2.0
2    NaN       Deepa    N    NaN
3    345         Ria    N    1.0
4    abc       Krish  1.2    2.0
5    223      Geetha    Y    NaN
6    568        Rimi  NaN    2.0
7    345       Goyal    Y    NaN
8    101        Sita    Y    NaN

In [10]:
df['Grade'].isnull().sum()

4

In [11]:
df['Pass']

0      Y
1      N
2      N
3      N
4    1.2
5      Y
6    NaN
7      Y
8      Y
Name: Pass, dtype: object

In [12]:
count = 0
for row in df['Pass']:
    try:
        float(row)
        df.loc[count,'Pass'] = np.nan
    except:
        pass
    count +=1

In [13]:
df

  SLName StudentName Pass  Grade
0    104       Priya    Y    2.0
1    108      Ramesh    N    2.0
2    NaN       Deepa    N    NaN
3    345         Ria    N    1.0
4    abc       Krish  NaN    2.0
5    223      Geetha    Y    NaN
6    568        Rimi  NaN    2.0
7    345       Goyal    Y    NaN
8    101        Sita    Y    NaN

In [14]:
df['SLName']

0    104
1    108
2    NaN
3    345
4    abc
5    223
6    568
7    345
8    101
Name: SLName, dtype: object

In [15]:
count = 0
for row in df['SLName']:
    try:
        int(row)
        print("integer")
    except:
        df.loc[count, 'SLName'] = np.nan
        print("except")
    count +=1

integer
integer
except
integer
except
integer
integer
integer
integer

In [16]:
df['SLName']

0    104
1    108
2    NaN
3    345
4    NaN
5    223
6    568
7    345
8    101
Name: SLName, dtype: object

In [17]:
df['SLName'].fillna(120, inplace=True)

In [18]:
df

  SLName StudentName Pass  Grade
0    104       Priya    Y    2.0
1    108      Ramesh    N    2.0
2    120       Deepa    N    NaN
3    345         Ria    N    1.0
4    120       Krish  NaN    2.0
5    223      Geetha    Y    NaN
6    568        Rimi  NaN    2.0
7    345       Goyal    Y    NaN
8    101        Sita    Y    NaN

In [19]:
df = df[['SLName','StudentName','Pass','Grade']]

In [20]:
df

  SLName StudentName Pass  Grade
0    104       Priya    Y    2.0
1    108      Ramesh    N    2.0
2    120       Deepa    N    NaN
3    345         Ria    N    1.0
4    120       Krish  NaN    2.0
5    223      Geetha    Y    NaN
6    568        Rimi  NaN    2.0
7    345       Goyal    Y    NaN
8    101        Sita    Y    NaN

In [21]:
df['Grade']

0    2.0
1    2.0
2    NaN
3    1.0
4    2.0
5    NaN
6    2.0
7    NaN
8    NaN
Name: Grade, dtype: float64

In [22]:
df['Grade'].value_counts()

2.0    4
1.0    1
Name: Grade, dtype: int64

In [23]:
df['Grade'].fillna(2.0, inplace=True)

In [24]:
df

  SLName StudentName Pass  Grade
0    104       Priya    Y    2.0
1    108      Ramesh    N    2.0
2    120       Deepa    N    2.0
3    345         Ria    N    1.0
4    120       Krish  NaN    2.0
5    223      Geetha    Y    2.0
6    568        Rimi  NaN    2.0
7    345       Goyal    Y    2.0
8    101        Sita    Y    2.0

In [25]:
df['Grade'].median()

2.0

In [26]:
df['Pass']

0      Y
1      N
2      N
3      N
4    NaN
5      Y
6    NaN
7      Y
8      Y
Name: Pass, dtype: object

In [27]:
df['Pass'].dropna()

0    Y
1    N
2    N
3    N
5    Y
7    Y
8    Y
Name: Pass, dtype: object

In [28]:
df = df.dropna()

In [29]:
df

  SLName StudentName Pass  Grade
0    104       Priya    Y    2.0
1    108      Ramesh    N    2.0
2    120       Deepa    N    2.0
3    345         Ria    N    1.0
5    223      Geetha    Y    2.0
7    345       Goyal    Y    2.0
8    101        Sita    Y    2.0

In [30]:
df.to_csv('student_cleaned.csv')